homeworks/hw2_rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date ASC
---

	end

	@movies = Movie.find_all_by_rating(@selected_ratings, sort)