homeworks/hw4_rottenpotatoes/app/controllers/movies_controller.rb

  def find_same_director
	@director = Movie.find(params[:id]).director
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
UPDATE "movies" SET "director" = 'test', "updated_at" = '2012-10-31 19:05:46.491813' WHERE "movies"."id" = 1